In [1]:
import duckdb as db
import pandas as pd

In [2]:
def sql(query, database = "../data/database.duckdb"):
    con = db.connect(database)
    res = con.execute(query).df()
    con.close()
    return res

In [ ]:
sql(
    """ 
    WITH num_votes_quartiles AS
    (SELECT 
    tconst,
    NTILE(4) OVER(ORDER BY numVotes) AS quartile
    FROM title_basics AS tb
    JOIN title_ratings USING(tconst))
    SELECT
    *
    FROM title_basics AS tb
    JOIN num_votes_quartiles USING(tconst)
    JOIN title_ratings USING(tconst)
    WHERE quartile = 4
    ORDER BY numVotes

    """
)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,quartile,averageRating,numVotes
0,tt0830184,movie,Where Souls Go,Kuhu põgenevad hinged,0,2007,\N,87,Drama,4,5.2,316
1,tt0773309,movie,Someone Else,Someone Else,0,2006,\N,78,"Comedy,Drama",4,5.8,316
2,tt0880566,movie,The Beheaded Rooster,Der geköpfte Hahn,0,2007,\N,98,Drama,4,6.5,316
3,tt0041643,movie,Massacre River,Massacre River,0,1949,\N,78,Western,4,6.0,316
4,tt0041823,movie,The Singing Princess,La rosa di Bagdad,0,1949,\N,76,"Animation,Family,Fantasy",4,6.6,316
...,...,...,...,...,...,...,...,...,...,...,...,...
82375,tt0109830,movie,Forrest Gump,Forrest Gump,0,1994,\N,142,"Drama,Romance",4,8.8,2378456
82376,tt0137523,movie,Fight Club,Fight Club,0,1999,\N,139,"Crime,Drama,Thriller",4,8.8,2464072
82377,tt1375666,movie,Inception,Inception,0,2010,\N,148,"Action,Adventure,Sci-Fi",4,8.8,2682513
82378,tt0468569,movie,The Dark Knight,The Dark Knight,0,2008,\N,152,"Action,Crime,Drama",4,9.0,3019825
82379,tt0111161,movie,The Shawshank Redemption,The Shawshank Redemption,0,1994,\N,142,Drama,4,9.3,3042795

In [32]:
sql(
    """ 
    WITH ratings_quartiles AS
    (SELECT 
    tconst,
    NTILE(4) OVER(ORDER BY averageRating) AS rating_quartile
    FROM title_basics AS tb
    JOIN title_ratings USING(tconst))
    
    SELECT
    *
    FROM title_basics AS tb
    JOIN ratings_quartiles USING(tconst)
    JOIN title_ratings USING(tconst)
    WHERE rating_quartile = 4
    ORDER BY averageRating

    """
)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,rating_quartile,averageRating,numVotes
0,tt8281226,movie,Li'l Mayne and the Knuckleheads,Li'l Mayne and the Knuckleheads,0,2019,\N,\N,"Comedy,Drama",4,7.1,19
1,tt8297284,movie,Everest Green,Everest Green,0,2018,\N,53,Documentary,4,7.1,16
2,tt8302712,movie,The Second Life,The Second Life,0,2020,\N,90,Documentary,4,7.1,11
3,tt8303586,movie,Lucas Debargue: To Music,Lucas Debargue - tout à la musique,0,2017,\N,84,"Biography,Documentary,Music",4,7.1,10
4,tt8305116,movie,Ayka,Ayka,0,2018,\N,100,Drama,4,7.1,2475
...,...,...,...,...,...,...,...,...,...,...,...,...
82375,tt36694936,movie,Famous Patrick (A Super SpongeBob Fan Movie),Famous Patrick (A Super SpongeBob Fan Movie),0,2024,\N,53,Adventure,4,10.0,12
82376,tt27649558,movie,Regal vs. Rebel,Regal vs. Rebel,0,2023,\N,\N,"Drama,Mystery,Romance",4,10.0,5
82377,tt28679713,movie,Lost,Paran,0,2023,\N,105,"Drama,Mystery",4,10.0,6
82378,tt2271581,movie,Saybrook: The Tully Girls,Saybrook: The Tully Girls,0,2011,\N,67,"Drama,Family,History",4,10.0,10
82379,tt7989204,movie,P Rell: Crucifix,P Rell: Crucifix,0,2013,\N,5,Music,4,10.0,16

In [35]:
sql(
    """ 
    WITH ratings_quartiles AS
    (SELECT 
    tconst,
    NTILE(4) OVER(ORDER BY averageRating) AS rating_quartile
    FROM title_basics AS tb
    JOIN title_ratings USING(tconst)),
    num_votes_quartiles AS
    (SELECT 
    tconst,
    NTILE(4) OVER(ORDER BY numVotes) AS votes_quartile
    FROM title_basics AS tb
    JOIN title_ratings USING(tconst))
    
    SELECT
    *
    FROM title_basics AS tb
    JOIN ratings_quartiles USING(tconst)
    JOIN num_votes_quartiles USING(tconst)
    JOIN title_ratings USING(tconst)
    WHERE rating_quartile = 4 and votes_quartile =4
    ORDER BY numVotes 
    """
)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,rating_quartile,votes_quartile,averageRating,numVotes
0,tt0271793,movie,Sociology Is a Martial Art,La sociologie est un sport de combat,0,2001,\N,146,Documentary,4,4,7.6,316
1,tt0275205,movie,Aval Appadithaan,Aval Appadithaan,0,1978,\N,114,Drama,4,4,8.1,316
2,tt11924122,movie,Ananya,Ananya,0,2022,\N,122,Drama,4,4,7.4,316
3,tt12343594,movie,"By the Way, Woody Allen Is Innocent","By the Way, Woody Allen Is Innocent",0,2020,\N,155,Documentary,4,4,7.9,316
4,tt5134588,movie,Chasing Asylum,Chasing Asylum,0,2016,\N,90,Documentary,4,4,7.2,316
...,...,...,...,...,...,...,...,...,...,...,...,...,...
15956,tt0109830,movie,Forrest Gump,Forrest Gump,0,1994,\N,142,"Drama,Romance",4,4,8.8,2378456
15957,tt0137523,movie,Fight Club,Fight Club,0,1999,\N,139,"Crime,Drama,Thriller",4,4,8.8,2464072
15958,tt1375666,movie,Inception,Inception,0,2010,\N,148,"Action,Adventure,Sci-Fi",4,4,8.8,2682513
15959,tt0468569,movie,The Dark Knight,The Dark Knight,0,2008,\N,152,"Action,Crime,Drama",4,4,9.0,3019825
15960,tt0111161,movie,The Shawshank Redemption,The Shawshank Redemption,0,1994,\N,142,Drama,4,4,9.3,3042795

In [3]:
sql(
    """ 
    select primaryTitle as Title,
    startYear as Year,
    runtimeMinutes as Runtime,
    nb.primaryName as Director
    from title_basics tb
    join title_akas ta on tconst = titleId
    join title_crew using (tconst)
    join name_basics nb on directors = nconst
    where region like 'US'
"""
)

                        Title  Year Runtime                 Director
0                  Kryptonite  2015      80           Nicanor Loreti
1       The Birch-Tree Meadow  2003      91  Marceline Loridan Ivens
2            My Brother's Gun  1997      93               Ray Loriga
3             The Age of Love  2014      79            Steven Loring
4           He Hired the Boss  1943      72         Thomas Z. Loring
...                       ...   ...     ...                      ...
307653          Beating Heart  2020      85           Laurent Caujat
307654           Spider Woman  2007      88              C. Rattapol
307655       Time of Moulting  2020      80          Sabrina Mertens
307656      Torment of Angels  2017     127               Jay Coster
307657      Tried in the Fire  2021      90         Jason T. Mahoney

[307658 rows x 4 columns]

In [7]:
sql("""
    Select
    primaryTitle,
    primaryName 
    from title_basics
    join title_principals using (tconst)
    join name_basics using (nconst)
    limit 1
    """)

  primaryTitle      primaryName
0   Miss Jerry  Blanche Bayliss

In [ ]:
sql("""    
    
    select distinct
    Tconst as tconst,
    tb.primaryTitle as Title,
    tb.genres as Genres,
    startYear as Year,
    runtimeMinutes as Runtime,
    nb.primaryName as Actor,
    nb.primaryName as Director,
    t.overview as Resume,
    tr.averageRating as Rating,
    tr.numVotes as Votes,
    t.Budget as Budget,
    t.Revenue as Revenue,
    production_companies_name as ProductionCompanies,
    production_companies_country as ProductionCountries,
    t.poster_path as Poster
    from title_basics tb
    join title_akas ta on tconst = titleId
    join title_crew using (tconst)
    join name_basics nb on directors = nconst
    join tmdb t on t.imdb_id = tb.tconst
    join title_ratings tr on tb.tconst = tr.tconst
    join title_principals tp on tconst = tp.tconst
    where tp.category like '%actor%' or tp.category like '%actress%'
    ORDER BY Revenue desc
    Limit 1
    """)

  category
0    actor

In [4]:
df = pd.read_parquet("../data/app_df.gzip")
df.head()

,tconst,Title,Genres,Year,Runtime,Actors,Director,Writers,Resume,Rating,Votes,Budget,Revenue,Profit,ProductionCompanies,ProductionCountries,Poster
0,tt0499549,Avatar,"Action,Adventure,Fantasy",2009,162,"Zoe Saldaña, Giovanni Ribisi, CCH Pounder, Mic...",James Cameron,James Cameron,"In the 22nd century, a paraplegic Marine is di...",7.9,1430785,237000000,2923706026,2686706026,"['Dune Entertainment', 'Lightstorm Entertainme...","['US', 'US', 'US', 'GB']",/jRXYjXNq0Cs2TcJjLkki24MLp7u.jpg
1,tt4154796,Avengers: Endgame,"Action,Adventure,Sci-Fi",2019,181,"Jeremy Renner, Don Cheadle, Chris Evans, Chadw...","Anthony Russo, Joe Russo","Christopher Markus, Steve Englehart, Jack Kirb...",After the devastating events of Avengers: Infi...,8.4,1357117,356000000,2794731755,2438731755,['Marvel Studios'],None,/or06FN3Dka5tukK1e9sl16pB3iy.jpg
2,tt0120338,Titanic,"Drama,Romance",1997,194,"Kate Winslet, Frances Fisher, Billy Zane, Davi...",James Cameron,James Cameron,101-year-old Rose DeWitt Bukater tells the sto...,7.9,1339359,200000000,2264162353,2064162353,"['Paramount', '20th Century Fox', 'Lightstorm ...","['US', 'US', 'US']",/9xjZS2rlVxm8SFx8kPC3aIGCOYQ.jpg
3,tt1630029,Avatar: The Way of Water,"Action,Adventure,Fantasy",2022,192,"Cliff Curtis, CCH Pounder, Sam Worthington, Si...",James Cameron,"Rick Jaffa, Shane Salerno, James Cameron, Aman...",Set more than a decade after the events of the...,7.5,534023,460000000,2319331580,1859331580,"['20th Century Studios', 'Lightstorm Entertain...",None,/t6HIqrRAclMCA60NsSmeqe9RmNV.jpg
4,tt2488496,Star Wars: Episode VII - The Force Awakens,"Action,Adventure,Sci-Fi",2015,138,"Domhnall Gleeson, Lupita Nyong'o, Mark Hamill,...",J.J. Abrams,"George Lucas, Michael Arndt, J.J. Abrams, Lawr...",Thirty years after defeating the Galactic Empi...,7.8,999627,245000000,2068223624,1823223624,"['Lucasfilm Ltd.', 'Bad Robot']",None,/wqnLdwVXoBjKibFRR5U3y0aDUhs.jpg

In [5]:
genre_series = df['Genres'].str.split(',')
genre_list = [genre for sublist in genre_series for genre in sublist]
genre_list = list(filter(lambda x: x not in ['\\N', 'Adult'], genre_list))
genre_list = pd.Series(genre_list)

In [7]:
genre_list.unique()

array(['Action', 'Adventure', 'Fantasy', 'Sci-Fi', 'Drama', 'Romance',
       'Animation', 'Thriller', 'Comedy', 'Family', 'Crime', 'Biography',
       'Music', 'History', 'Horror', 'Mystery', 'Musical', 'War',
       'Western', 'Sport', 'Documentary', 'Film-Noir', 'Reality-TV',
       'News'], dtype=object)

In [ ]:
df[df['Genres' == 'Action']]

0         False
1         False
2         False
3         False
4         False
          ...
101539    False
101540    False
101541    False
101542    False
101543    False
Name: Genres, Length: 101544, dtype: bool

In [10]:
df[df['Poster'] == '/jRXYjXNq0Cs2TcJjLkki24MLp7u.jpg']['Title'].iloc[0]

'Avatar'